.svn/pristine/4b/4be180276e7c64a22b5fe7934193b1f3ad5c617d.svn-base

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://WebService/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="WS" targetNamespace="http://WebService/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://timbrador.cepdi.mx:8443/WSDemo/WS?xsd=1" namespace="http://WebService/" />
    </xsd:schema>
  </types>
  <message name="TimbraComprobante">
    <part name="parameters" element="tns:TimbraComprobante" />
  </message>
  <message name="TimbraComprobanteResponse">
    <part name="parameters" element="tns:TimbraComprobanteResponse" />
  </message>
  <message name="TimbraXMLRetenciones">
    <part name="parameters" element="tns:TimbraXMLRetenciones" />
  </message>
  <message name="TimbraXMLRetencionesResponse">
    <part name="parameters" element="tns:TimbraXMLRetencionesResponse" />
  </message>
  <message name="ObtenerPDFValidacion">
    <part name="parameters" element="tns:ObtenerPDFValidacion" />
  </message>
  <message name="ObtenerPDFValidacionResponse">
    <part name="parameters" element="tns:ObtenerPDFValidacionResponse" />
  </message>
  <message name="CancelaRetencionEnc">
    <part name="parameters" element="tns:CancelaRetencionEnc" />
  </message>
  <message name="CancelaRetencionEncResponse">
    <part name="parameters" element="tns:CancelaRetencionEncResponse" />
  </message>
  <message name="ObtenerDatosCuenta">
    <part name="parameters" element="tns:ObtenerDatosCuenta" />
  </message>
  <message name="ObtenerDatosCuentaResponse">
    <part name="parameters" element="tns:ObtenerDatosCuentaResponse" />
  </message>
  <message name="ValidaComprobante">
    <part name="parameters" element="tns:ValidaComprobante" />
  </message>
  <message name="ValidaComprobanteResponse">
    <part name="parameters" element="tns:ValidaComprobanteResponse" />
  </message>
  <message name="CancelaRetencionPXF">
    <part name="parameters" element="tns:CancelaRetencionPXF" />
  </message>
  <message name="CancelaRetencionPXFResponse">
    <part name="parameters" element="tns:CancelaRetencionPXFResponse" />
  </message>
  <message name="TimbraXMLEnc">
    <part name="parameters" element="tns:TimbraXMLEnc" />
  </message>
  <message name="TimbraXMLEncResponse">
    <part name="parameters" element="tns:TimbraXMLEncResponse" />
  </message>
  <message name="ObtenerXML">
    <part name="parameters" element="tns:ObtenerXML" />
  </message>
  <message name="ObtenerXMLResponse">
    <part name="parameters" element="tns:ObtenerXMLResponse" />
  </message>
  <message name="CancelaRetencion">
    <part name="parameters" element="tns:CancelaRetencion" />
  </message>
  <message name="CancelaRetencionResponse">
    <part name="parameters" element="tns:CancelaRetencionResponse" />
  </message>
  <message name="AgregaTicket">
    <part name="parameters" element="tns:AgregaTicket" />
  </message>
  <message name="AgregaTicketResponse">
    <part name="parameters" element="tns:AgregaTicketResponse" />
  </message>
  <message name="TimbraRetencion">
    <part name="parameters" element="tns:TimbraRetencion" />
  </message>
  <message name="TimbraRetencionResponse">
    <part name="parameters" element="tns:TimbraRetencionResponse" />
  </message>
  <message name="ObtenerPDF">
    <part name="parameters" element="tns:ObtenerPDF" />
  </message>
  <message name="ObtenerPDFResponse">
    <part name="parameters" element="tns:ObtenerPDFResponse" />
  </message>
  <message name="TimbraNomina">
    <part name="parameters" element="tns:TimbraNomina" />
  </message>
  <message name="TimbraNominaResponse">
    <part name="parameters" element="tns:TimbraNominaResponse" />
  </message>
  <message name="CancelaCFDIEnc">
    <part name="parameters" element="tns:CancelaCFDIEnc" />
  </message>
  <message name="CancelaCFDIEncResponse">
    <part name="parameters" element="tns:CancelaCFDIEncResponse" />
  </message>
  <message name="CancelaCFDI">
    <part name="parameters" element="tns:CancelaCFDI" />
  </message>
  <message name="CancelaCFDIResponse">
    <part name="parameters" element="tns:CancelaCFDIResponse" />
  </message>
  <message name="TimbraXML">
    <part name="parameters" element="tns:TimbraXML" />
  </message>
  <message name="TimbraXMLResponse">
    <part name="parameters" element="tns:TimbraXMLResponse" />
  </message>
  <portType name="WS">
    <operation name="TimbraComprobante">
      <input wsam:Action="http://WebService/WS/TimbraComprobanteRequest" message="tns:TimbraComprobante" />
      <output wsam:Action="http://WebService/WS/TimbraComprobanteResponse" message="tns:TimbraComprobanteResponse" />
    </operation>
    <operation name="TimbraXMLRetenciones">
      <input wsam:Action="http://WebService/WS/TimbraXMLRetencionesRequest" message="tns:TimbraXMLRetenciones" />
      <output wsam:Action="http://WebService/WS/TimbraXMLRetencionesResponse" message="tns:TimbraXMLRetencionesResponse" />
    </operation>
    <operation name="ObtenerPDFValidacion">
      <input wsam:Action="http://WebService/WS/ObtenerPDFValidacionRequest" message="tns:ObtenerPDFValidacion" />
      <output wsam:Action="http://WebService/WS/ObtenerPDFValidacionResponse" message="tns:ObtenerPDFValidacionResponse" />
    </operation>
    <operation name="CancelaRetencionEnc">
      <input wsam:Action="http://WebService/WS/CancelaRetencionEncRequest" message="tns:CancelaRetencionEnc" />
      <output wsam:Action="http://WebService/WS/CancelaRetencionEncResponse" message="tns:CancelaRetencionEncResponse" />
    </operation>
    <operation name="ObtenerDatosCuenta">
      <input wsam:Action="http://WebService/WS/ObtenerDatosCuentaRequest" message="tns:ObtenerDatosCuenta" />
      <output wsam:Action="http://WebService/WS/ObtenerDatosCuentaResponse" message="tns:ObtenerDatosCuentaResponse" />
    </operation>
    <operation name="ValidaComprobante">
      <input wsam:Action="http://WebService/WS/ValidaComprobanteRequest" message="tns:ValidaComprobante" />
      <output wsam:Action="http://WebService/WS/ValidaComprobanteResponse" message="tns:ValidaComprobanteResponse" />
    </operation>
    <operation name="CancelaRetencionPXF">
      <input wsam:Action="http://WebService/WS/CancelaRetencionPXFRequest" message="tns:CancelaRetencionPXF" />
      <output wsam:Action="http://WebService/WS/CancelaRetencionPXFResponse" message="tns:CancelaRetencionPXFResponse" />
    </operation>
    <operation name="TimbraXMLEnc">
      <input wsam:Action="http://WebService/WS/TimbraXMLEncRequest" message="tns:TimbraXMLEnc" />
      <output wsam:Action="http://WebService/WS/TimbraXMLEncResponse" message="tns:TimbraXMLEncResponse" />
    </operation>
    <operation name="ObtenerXML">
      <input wsam:Action="http://WebService/WS/ObtenerXMLRequest" message="tns:ObtenerXML" />
      <output wsam:Action="http://WebService/WS/ObtenerXMLResponse" message="tns:ObtenerXMLResponse" />
    </operation>
    <operation name="CancelaRetencion">
      <input wsam:Action="http://WebService/WS/CancelaRetencionRequest" message="tns:CancelaRetencion" />
      <output wsam:Action="http://WebService/WS/CancelaRetencionResponse" message="tns:CancelaRetencionResponse" />
    </operation>
    <operation name="AgregaTicket">
      <input wsam:Action="http://WebService/WS/AgregaTicketRequest" message="tns:AgregaTicket" />
      <output wsam:Action="http://WebService/WS/AgregaTicketResponse" message="tns:AgregaTicketResponse" />
    </operation>
    <operation name="TimbraRetencion">
      <input wsam:Action="http://WebService/WS/TimbraRetencionRequest" message="tns:TimbraRetencion" />
      <output wsam:Action="http://WebService/WS/TimbraRetencionResponse" message="tns:TimbraRetencionResponse" />
    </operation>
    <operation name="ObtenerPDF">
      <input wsam:Action="http://WebService/WS/ObtenerPDFRequest" message="tns:ObtenerPDF" />
      <output wsam:Action="http://WebService/WS/ObtenerPDFResponse" message="tns:ObtenerPDFResponse" />
    </operation>
    <operation name="TimbraNomina">
      <input wsam:Action="http://WebService/WS/TimbraNominaRequest" message="tns:TimbraNomina" />
      <output wsam:Action="http://WebService/WS/TimbraNominaResponse" message="tns:TimbraNominaResponse" />
    </operation>
    <operation name="CancelaCFDIEnc">
      <input wsam:Action="http://WebService/WS/CancelaCFDIEncRequest" message="tns:CancelaCFDIEnc" />
      <output wsam:Action="http://WebService/WS/CancelaCFDIEncResponse" message="tns:CancelaCFDIEncResponse" />
    </operation>
    <operation name="CancelaCFDI">
      <input wsam:Action="http://WebService/WS/CancelaCFDIRequest" message="tns:CancelaCFDI" />
      <output wsam:Action="http://WebService/WS/CancelaCFDIResponse" message="tns:CancelaCFDIResponse" />
    </operation>
    <operation name="TimbraXML">
      <input wsam:Action="http://WebService/WS/TimbraXMLRequest" message="tns:TimbraXML" />
      <output wsam:Action="http://WebService/WS/TimbraXMLResponse" message="tns:TimbraXMLResponse" />
    </operation>
  </portType>
  <binding name="WSPortBinding" type="tns:WS">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="TimbraComprobante">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="TimbraXMLRetenciones">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="ObtenerPDFValidacion">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="CancelaRetencionEnc">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="ObtenerDatosCuenta">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="ValidaComprobante">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="CancelaRetencionPXF">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="TimbraXMLEnc">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="ObtenerXML">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="CancelaRetencion">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="AgregaTicket">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="TimbraRetencion">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="ObtenerPDF">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="TimbraNomina">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="CancelaCFDIEnc">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="CancelaCFDI">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="TimbraXML">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="WS">
    <port name="WSPort" binding="tns:WSPortBinding">
      <soap:address location="https://timbrador.cepdi.mx:8443/WSDemo/WS" />
    </port>
  </service>
</definitions>